In [1]:
import pandas as pd 
import numpy as np

In [2]:
df=pd.read_excel("./student.xlsx")

In [3]:
df.head()

    Name    Caste  Math  English  Science
0    Ram  Brahmin    78       65       80
1  Shyam  Chhetri    82       70       75
2   Sita    Newar    90       88       92
3   Gita   Tamang    67       72       70
4   Hari    Magar    74       69       73

In [4]:
df.shape

(10, 5)

In [9]:
df["Total"]=df[["Math","English","Science"]].sum(axis=1)
df["Average"]=df[["Math","English","Science"]].mean(axis=1)

In [10]:
df

    Name    Caste  Math  English  Science  Total    Average
0    Ram  Brahmin    78       65       80    223  74.333333
1  Shyam  Chhetri    82       70       75    227  75.666667
2   Sita    Newar    90       88       92    270  90.000000
3   Gita   Tamang    67       72       70    209  69.666667
4   Hari    Magar    74       69       73    216  72.000000
5   Nita      Rai    85       81       79    245  81.666667
6  Kiran    Limbu    88       84       86    258  86.000000
7  Anita   Gurung    76       73       78    227  75.666667
8  Suman    Tharu    69       66       71    206  68.666667
9  Pooja    Dalit    91       89       90    270  90.000000

In [12]:
df["Result"]=df['Average'].apply(lambda x: "Pass" if x>60 else "Fail")

In [13]:
df

    Name    Caste  Math  English  Science  Total    Average Result
0    Ram  Brahmin    78       65       80    223  74.333333   Pass
1  Shyam  Chhetri    82       70       75    227  75.666667   Pass
2   Sita    Newar    90       88       92    270  90.000000   Pass
3   Gita   Tamang    67       72       70    209  69.666667   Pass
4   Hari    Magar    74       69       73    216  72.000000   Pass
5   Nita      Rai    85       81       79    245  81.666667   Pass
6  Kiran    Limbu    88       84       86    258  86.000000   Pass
7  Anita   Gurung    76       73       78    227  75.666667   Pass
8  Suman    Tharu    69       66       71    206  68.666667   Pass
9  Pooja    Dalit    91       89       90    270  90.000000   Pass

In [24]:
df.to_excel("student_result.xlsx",index=False)